Revit 2027 API
ExporterIFCUtils.GetGlobal2DDirectionHandle Method
 Obtains the handle representing one cardinal direction in 2D.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCAnyHandle GetGlobal2DDirectionHandle(
	int index,
	bool positive
)
Public Shared Function GetGlobal2DDirectionHandle (
	index As Integer,
	positive As Boolean
) As IFCAnyHandle
public:
static IFCAnyHandle^ GetGlobal2DDirectionHandle(
	int index,
	bool positive
)
static member GetGlobal2DDirectionHandle :
        index : int *
        positive : bool -> IFCAnyHandle
Parameters
index Int32
 The index of the handle, where 0 is U and 1 is V.
positive Boolean
 True if the handle returned should be in the positive direction, false if the handle should be in the negative direction.
Return Value
IFCAnyHandle
 The cached direction handle.
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace